# 1. tk.Tk() - создание основного окна приложения.
# 2. pack() - метод для управления расположением виджета в окне.
# 3. grid() - метод для расположения виджетов в сетке окна.
# 4. place() - метод для позиционирования виджетов с точными координатами.
#
# Для создания различных виджетов и их конфигурации:
#
# 1. tk.Label() - создание текстовой метки.
# 2. tk.Button() - создание кнопки.
# 3. tk.Entry() - создание поля ввода текста.
# 4. tk.Text() - создание многострочного текстового поля.
# 5. tk.Checkbutton() - создание флажка (чекбокса).
# 6. tk.Radiobutton() - создание радиокнопки.
# 7. tk.Listbox() - создание списка для выбора элементов.
# 8. tk.Canvas() - создание холста для рисования графики.
#
# Для работы с событиями и обработки пользовательского ввода:
#
# 1. bind() - метод для привязки событий к виджетам.
# 2. get() - метод для получения значения из поля ввода.
# 3. insert() - метод для вставки текста в виджет.
# 4. delete() - метод для удаления части текста из виджета.
# 5. curselection() - метод для получения выбранных элементов из списка или другого виджета.
# 6. itemconfig() - метод для конфигурации отдельных элементов в списке или холсте.

# Напишите программу на Python с использованием модуля tkinter,
# которая позволяет пользователю ввести свое имя в окно ввода,
# а затем выводит на экран сообщение "Привет, [имя]!".
# В поле для ответа загрузи скриншоты своего запущенного кода в PyCharm.

import tkinter as tk
#from cProfile import label


def your_name():
    name = f"Hello, {w_entry.get()}" # Получаем имя из поля ввода
    w_label.config(text=name) # Обновляем текст метки с приветствием

window = tk.Tk() #create the window
window.title("Conversation")

w_label = tk.Label(window, text="Enter your name") #create the label
w_label.pack()

w_entry = tk.Entry(window)
w_entry.pack()

w_button = tk.Button(window, text="Enter", command= your_name)
w_button.pack()

window.mainloop()


